In [16]:
import pandas as pd

In [17]:
# Reading the CSV file 
df_exams = pd.read_csv("StudentsPerformance.csv")
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# Create Index

In [18]:
import numpy as np
import random

In [19]:
# Creating non repeptitive values for the index
new_index = np.arange(0, 1000)

In [20]:
# shuffling the indexes created above
random.shuffle(new_index)

In [21]:
# Creating a new colum with new index
df_exams["new_index"] = new_index
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,new_index
0,female,group B,bachelor's degree,standard,none,72,72,74,858
1,female,group C,some college,standard,completed,69,90,88,405
2,female,group B,master's degree,standard,none,90,95,93,323
3,male,group A,associate's degree,free/reduced,none,47,57,44,130
4,male,group C,some college,standard,none,76,78,75,301
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,373
996,male,group C,high school,free/reduced,none,62,55,55,281
997,female,group C,high school,free/reduced,completed,59,71,65,730
998,female,group D,some college,standard,completed,68,78,77,796
999,female,group D,some college,free/reduced,none,77,86,86,259

## Set index

In [23]:
df_exams.set_index("new_index", inplace=True)
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new_index,,,,,,,,
858,female,group B,bachelor's degree,standard,none,72,72,74
405,female,group C,some college,standard,completed,69,90,88
323,female,group B,master's degree,standard,none,90,95,93
130,male,group A,associate's degree,free/reduced,none,47,57,44
301,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
373,female,group E,master's degree,standard,completed,88,99,95
281,male,group C,high school,free/reduced,none,62,55,55
730,female,group C,high school,free/reduced,completed,59,71,65
796,female,group D,some college,standard,completed,68,78,77
259,female,group D,some college,free/reduced,none,77,86,86

## Sort index

In [25]:
# Sort dataframe by new index
df_exams.sort_index()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new_index,,,,,,,,
0,male,group D,some college,standard,completed,77,62,62
1,female,group C,associate's degree,free/reduced,completed,56,68,70
2,female,group B,some high school,standard,none,37,46,46
3,male,group D,high school,free/reduced,completed,64,64,67
4,male,group B,high school,standard,none,47,46,42
...,...,...,...,...,...,...,...,...
995,male,group A,master's degree,free/reduced,none,73,74,72
996,female,group C,high school,free/reduced,none,62,67,64
997,male,group E,associate's degree,standard,completed,94,85,82
998,male,group D,some high school,standard,none,55,47,44
999,female,group C,some college,free/reduced,completed,63,73,71

In [26]:
# Sort dataframe by new index by decenging
df_exams.sort_index(ascending = False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new_index,,,,,,,,
999,female,group C,some college,free/reduced,completed,63,73,71
998,male,group D,some high school,standard,none,55,47,44
997,male,group E,associate's degree,standard,completed,94,85,82
996,female,group C,high school,free/reduced,none,62,67,64
995,male,group A,master's degree,free/reduced,none,73,74,72
...,...,...,...,...,...,...,...,...
4,male,group B,high school,standard,none,47,46,42
3,male,group D,high school,free/reduced,completed,64,64,67
2,female,group B,some high school,standard,none,37,46,46
1,female,group C,associate's degree,free/reduced,completed,56,68,70
0,male,group D,some college,standard,completed,77,62,62

In [27]:
# To save the changes, we can use the inplace
df_exams.sort_index(ascending = False, inplace=True)

In [28]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
new_index,,,,,,,,
999,female,group C,some college,free/reduced,completed,63,73,71
998,male,group D,some high school,standard,none,55,47,44
997,male,group E,associate's degree,standard,completed,94,85,82
996,female,group C,high school,free/reduced,none,62,67,64
995,male,group A,master's degree,free/reduced,none,73,74,72
...,...,...,...,...,...,...,...,...
4,male,group B,high school,standard,none,47,46,42
3,male,group D,high school,free/reduced,completed,64,64,67
2,female,group B,some high school,standard,none,37,46,46
1,female,group C,associate's degree,free/reduced,completed,56,68,70
0,male,group D,some college,standard,completed,77,62,62